# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Vector graphics library with cross-device output support
brew "cairo"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# Core application library for C
brew "glib"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Multimedia framework for research and academic purposes
brew "gpac"
# OpenType text shaping engine
brew "harfbuzz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Implementation of malloc emphasizing fragmentation avoidance
brew "jemalloc"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Easy way to access the system keyring service from python
brew "keyring"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# Implementation of the file(1) command
brew "libmagic"
# Library for manipulating PNG images
brew "libpng"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Polyglot runtime and dev tool version manager (replaces nvm/rbenv/pyenv)
brew "mise"
# Package for scientific computing with Python
brew "numpy"
# Optimized BLAS library
brew "openblas"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Framework for layout and rendering of i18n text
brew "pango"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
