# Brewfile — Homebrew dependencies
#
# Install: brew bundle install
# Check:   brew bundle check

# === Build Tools ===

brew "gcc"                  # GNU compiler collection

# === Shell & Terminal ===

brew "coreutils"            # GNU File, Shell, and Text utilities
brew "jq"                   # JSON processor
brew "ripgrep"              # Fast grep alternative (rg)
brew "terminal-notifier"    # macOS notifications from command-line
brew "tmux"                 # Terminal multiplexer

# === Development ===

brew "mise"                 # Version manager (node/ruby/python)
brew "poetry"               # Python package management
brew "uv"                   # Fast Python installer (Rust)
brew "virtualenv"           # Python virtual environments

# === AI Tools ===

brew "gemini-cli"           # Google Gemini AI CLI
brew "repomix"              # Pack repo for AI context

# === Media Processing ===

brew "aom"                  # AV1 video codec
brew "ffmpeg"               # Audio/video conversion
brew "gpac"                 # Multimedia framework
brew "imagemagick"          # Image manipulation
brew "jpeg-xl"              # JPEG XL codec
brew "libass"               # ASS/SSA subtitle renderer
brew "libheif"              # HEIF image codec
brew "poppler"              # PDF rendering library

# === Scientific Computing ===

brew "numpy"                # Scientific computing (Python)
brew "openblas"             # Optimized BLAS library
brew "openvino"             # Intel AI inference toolkit

# === Libraries ===

brew "cairo"                # Vector graphics
brew "glib"                 # Core C library
brew "gnutls"               # TLS library
brew "harfbuzz"             # OpenType text shaping
brew "jemalloc"             # Memory allocator
brew "keyring"              # System keyring access (Python)
brew "liblqr"               # Seam carving library
brew "libmagic"             # File type detection
brew "libpng"               # PNG library
brew "librist"              # Reliable Internet Stream Transport
brew "pango"                # i18n text layout

# === Casks ===

cask "claude-code@latest"    # Anthropic Claude Code CLI
cask "codex"                # OpenAI Codex CLI
cask "xcodes-app"           # Xcode version manager
